Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <module name="PCHE" id="920" version="1.0">
          <instance name="PCHE">
            <register-group name="PCHE" name-in-module="PCHE" address-space="base" offset="0x44012400"/>
          </instance>
        </module>
        <module name="PFW" id="910" version="1.0">
          <instance name="PFW">
            <register-group name="PFW" name-in-module="PFW" address-space="base" offset="0x44000800"/>
          </instance>
        </module>
        <module name="PMU" id="U80" version="1.0">
          <instance name="PMU">
            <register-group name="PMU" name-in-module="PMU" address-space="base" offset="0x44013E00"/>
            <signals>
              <signal group="INT" index="0" pad="PB04"/>
            </signals>
          </instance>
        </module>
        <module name="PPS" id="U148" version="1.0">
          <instance name="PPS">
            <register-group name="PPS" name-in-module="PPS" address-space="base" offset="0x44001000"/>
            <signals>
              <signal group="RPA0" pad="PA00"/>
              <signal group="RPA1" pad="PA01"/>
              <signal group="RPA2" pad="PA02"/>
              <signal group="RPA3" pad="PA03"/>
              <signal group="RPA4" pad="PA04"/>
              <signal group="RPA5" pad="PA05"/>
              <signal group="RPA6" pad="PA06"/>
              <signal group="RPA7" pad="PA07"/>
              <signal group="RPA8" pad="PA08"/>
              <signal group="RPA9" pad="PA09"/>
              <signal group="RPA10" pad="PA10"/>
              <signal group="RPA13" pad="PA13"/>
              <signal group="RPA14" pad="PA14"/>
              <signal group="RPB0" pad="PB00"/>
              <signal group="RPB1" pad="PB01"/>
              <signal group="RPB2" pad="PB02"/>
              <signal group="RPB3" pad="PB03"/>
              <signal group="RPB4" pad="PB04"/>
              <signal group="RPB5" pad="PB05"/>
              <signal group="RPB6" pad="PB06"/>
              <signal group="RPB7" pad="PB07"/>
              <signal group="RPB8" pad="PB08"/>
              <signal group="RPB9" pad="PB09"/>
              <signal group="RPB10" pad="PB10"/>
              <signal group="RPB11" pad="PB11"/>
              <signal group="RPB12" pad="PB12"/>
              <signal group="RPB13" pad="PB13"/>
            </signals>
          </instance>
        </module>
        <module name="PUKCC" id="U2009" version="2.5.0">
          <instance name="PUKCC">
            <parameters>
              <param name="RAM_ADDR_SIZE" value="12"/>
              <param name="ROM_ADDR_SIZE" value="16"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
        </module>
        <module name="QSPI" id="U2008" version="1.6.3">
          <instance name="QSPI">
            <register-group name="QSPI" name-in-module="QSPI" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="DMAC_ID_RX" value="43"/>
              <param name="DMAC_ID_TX" value="44"/>
              <param name="HADDR_MSB" value="23"/>
              <param name="OCMS" value="1"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
            <signals>
              <signal group="QSPI_CS" function="QSPI" pad="PB10"/>
              <signal group="QSPI_DATA0" function="QSPI" pad="PB12"/>
              <signal group="QSPI_DATA1" function="QSPI" pad="PB13"/>
              <signal group="QSPI_DATA2" function="QSPI" pad="PA00"/>
              <signal group="QSPI_DATA3" function="QSPI" pad="PA01"/>
              <signal group="QSPI_SCK" function="QSPI" pad="PB11"/>
            </signals>
          </instance>
        </module>
        <module name="RAMECC" id="U2268" version="1.0.0">
          <instance name="RAMECC">
            <register-group name="RAMECC" name-in-module="RAMECC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="RAMADDR_BITS" value="13"/>
              <param name="RAMBANK_NUM" value="4"/>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="2.1.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x42010000"/>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1"/>
              <param name="GPR_NUM" value="4"/>
              <param name="NUM_OF_ALARMS" value="2"/>
              <param name="NUM_OF_BKREGS" value="8"/>
              <param name="NUM_OF_COMP16" value="4"/>
              <param name="NUM_OF_COMP32" value="2"/>
              <param name="NUM_OF_TAMPERS" value="5"/>
              <param name="PER_NUM" value="8"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
            <signals>
              <signal group="RTC_EVENT" function="RTCC" pad="PB13"/>
              <signal group="RTC_IN0" function="RTCC" pad="PA03"/>
              <signal group="RTC_IN0_ALT" function="RTCC" pad="PA09"/>
              <signal group="RTC_IN1" function="RTCC" pad="PA02"/>
              <signal group="RTC_IN2" function="RTCC" pad="PA01"/>
              <signal group="RTC_IN3" function="RTCC" pad="PA00"/>
              <signal group="RTC_OUT" function="RTCC" pad="PA01"/>
              <signal group="RTC_OUT_ALT" function="RTCC" pad="PA10"/>
            </signals>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="5.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x40000c00"/>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
            <signals>
              <signal group="SERCOM0_PAD" index="0" function="SERCOM0" pad="PA05"/>
              <signal group="SERCOM0_PAD" index="1" function="SERCOM0" pad="PA06"/>
              <signal group="SERCOM0_PAD" index="2" function="SERCOM0" pad="PA03"/>
              <signal group="SERCOM0_PAD" index="3" function="SERCOM0" pad="PA04"/>
            </signals>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
            <signals>
              <signal group="SERCOM1_PAD" index="0" function="SERCOM1" pad="PA07"/>
              <signal group="SERCOM1_PAD" index="1" function="SERCOM1" pad="PA08"/>
              <signal group="SERCOM1_PAD" index="2" function="SERCOM1" pad="PA09"/>
              <signal group="SERCOM1_PAD" index="3" function="SERCOM1" pad="PA10"/>
            </signals>
          </instance>
