Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000c00"/>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="4"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
            <signals>
              <signal group="SERCOM2_PAD" index="0" function="SERCOM2" pad="PA13"/>
              <signal group="SERCOM2_PAD" index="1" function="SERCOM2" pad="PA14"/>
            </signals>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <parameters>
              <param name="CLK_REDUCTION" value="1"/>
              <param name="DLY_COMPENSATION" value="1"/>
              <param name="DMA" value="1"/>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="11"/>
              <param name="FIFO_DEPTH_POWER" value="1"/>
              <param name="GCLK_ID_CORE" value="4"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0"/>
              <param name="SE_CNT" value="1"/>
              <param name="SPI" value="1"/>
              <param name="SPI_HW_SS_CTRL" value="1"/>
              <param name="SPI_ICSPACE_EXT" value="1"/>
              <param name="SPI_OZMO" value="0"/>
              <param name="SPI_WAKE_ON_SSL" value="1"/>
              <param name="TTBIT_EXTENSION" value="1"/>
              <param name="TWIM" value="1"/>
              <param name="TWIS" value="1"/>
              <param name="TWIS_AUTO_ACK" value="1"/>
              <param name="TWIS_GROUP_CMD" value="1"/>
              <param name="TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="TWIS_SDASETUP_SIZE" value="4"/>
              <param name="TWIS_SUDAT" value="1"/>
              <param name="TWI_FASTMP" value="1"/>
              <param name="TWI_HSMODE" value="1"/>
              <param name="TWI_SCLSM_MODE" value="1"/>
              <param name="TWI_SMB_TIMEOUTS" value="1"/>
              <param name="TWI_TENBIT_ADR" value="1"/>
              <param name="USART" value="1"/>
              <param name="USART_AUTOBAUD" value="1"/>
              <param name="USART_COLDET" value="1"/>
              <param name="USART_FLOW_CTRL" value="1"/>
              <param name="USART_FRAC_BAUD" value="1"/>
              <param name="USART_IRDA" value="1"/>
              <param name="USART_ISO7816" value="1"/>
              <param name="USART_LIN_MASTER" value="1"/>
              <param name="USART_RS485" value="1"/>
              <param name="USART_SAMPA_EXT" value="1"/>
              <param name="USART_SAMPR_EXT" value="1"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="29"/>
              <param name="DMAC_ID_MC_0" value="30"/>
              <param name="DMAC_ID_MC_1" value="31"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="22"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="32"/>
              <param name="DMAC_ID_MC_0" value="33"/>
              <param name="DMAC_ID_MC_1" value="34"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="23"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x40001C00"/>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="35"/>
              <param name="DMAC_ID_MC_0" value="36"/>
              <param name="DMAC_ID_MC_1" value="37"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="6"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="38"/>
              <param name="DMAC_ID_MC_0" value="39"/>
              <param name="DMAC_ID_MC_1" value="40"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="6"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.1.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="CC_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="12"/>
              <param name="DMAC_ID_MC_0" value="13"/>
              <param name="DMAC_ID_MC_1" value="14"/>
              <param name="DMAC_ID_MC_2" value="15"/>
              <param name="DMAC_ID_MC_3" value="16"/>
              <param name="DMAC_ID_MC_4" value="17"/>
              <param name="DMAC_ID_MC_5" value="18"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="21"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x40002800"/>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="19"/>
              <param name="DMAC_ID_MC_0" value="20"/>
              <param name="DMAC_ID_MC_1" value="21"/>
              <param name="DMAC_ID_MC_2" value="22"/>
              <param name="DMAC_ID_MC_3" value="23"/>
              <param name="DMAC_ID_MC_4" value="24"/>
              <param name="DMAC_ID_MC_5" value="25"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="5"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
