Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
      <value-group name="AES_CTRLA__KEYSIZE">
        <value name="128BIT" caption="128-bit Key for Encryption / Decryption" value="0x0"/>
        <value name="192BIT" caption="192-bit Key for Encryption / Decryption" value="0x1"/>
        <value name="256BIT" caption="256-bit Key for Encryption / Decryption" value="0x2"/>
      </value-group>
      <value-group name="AES_CTRLA__LOD">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="LAST" caption="Start encryption in Last Output Data mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__STARTMODE">
        <value name="MANUAL" caption="Start Encryption / Decryption in Manual mode" value="0x0"/>
        <value name="AUTO" caption="Start Encryption / Decryption in Auto mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__XORKEY">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="XOR" caption="The user keyword gets XORed with the previous keyword register content." value="0x1"/>
      </value-group>
    </module>
    <module caption="BLE" version="1.0" id="U6667" name="BLE">
      <register-group caption="BLE" name="BLE">
        <!-- Turned bit fields into registers for Chris here -->
        <register name="DPLL_RG1" offset="0x04B8" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG1BITS" mask="0xFFFF" caption=""/>
        </register>
        <register name="DPLL_RG2" offset="0x04BA" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG2BITS" mask="0xFFFF" caption=""/>
        </register>
      </register-group>
    </module>
    <module name="BTZBSYS" id="U9998" version="1.0.0" caption="BT ZB Subsystem">
      <register-group name="BTZBSYS" caption="">
        <register name="SUBSYS_CNTRL_REG0" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_CNTRL_REG0">
          <bitfield name="bt_en_main_clk" caption="bt_en_main_clk" mask="0x100000"/>
          <bitfield name="bt_reset_by_fw" caption="bt_reset_by_fw" mask="0x80000"/>
          <bitfield name="bt_hw_rc_re_cal" caption="bt_hw_rc_re_cal" mask="0x40000"/>
          <bitfield name="bt_sfr_wakeup_bit" caption="bt_sfr_wakeup_bit" mask="0x20000"/>
          <bitfield name="bt_pdc_ov" caption="bt_pdc_ov" mask="0x10000"/>
          <bitfield name="ant_div_sel_2_iom_en" caption="ant_div_sel_2_iom_en" mask="0x40"/>
          <bitfield name="ant_div_sel_1_iom_en" caption="ant_div_sel_1_iom_en" mask="0x20"/>
          <bitfield name="zb_en_main_clk" caption="zb_en_main_clk" mask="0x10"/>
          <bitfield name="zb_reset_by_fw" caption="zb_reset_by_fw" mask="0x8"/>
          <bitfield name="zb_soft_reset_in" caption="zb_soft_reset_in" mask="0x2"/>
          <bitfield name="zb_slp_ctrl" caption="zb_slp_ctrl" mask="0x1"/>
        </register>
        <register name="SUBSYS_CNTRL_REG1" offset="0x4" rw="RW" size="4" access-size="4" initval="0x0000F000" caption="SUBSYS_CNTRL_REG1">
          <bitfield name="clk_lp_req" caption="clk_lp_req" mask="0x800000"/>
          <bitfield name="invert_btadc_clk" caption="invert_btadc_clk" mask="0x400000"/>
          <bitfield name="zb_bt_bar_ovrd_val" caption="zb_bt_bar_ovrd_val" mask="0x200000"/>
          <bitfield name="zb_bt_bar_ovrd_en" caption="zb_bt_bar_ovrd_en" mask="0x100000"/>
          <bitfield name="lna_on_iom_en" caption="lna_on_iom_en" mask="0x80000"/>
          <bitfield name="pa_on_iom_en" caption="pa_on_iom_en" mask="0x40000"/>
          <bitfield name="tr_sw_n_iom_en" caption="tr_sw_n_iom_en" mask="0x20000"/>
          <bitfield name="tr_sw_iom_en" caption="tr_sw_iom_en" mask="0x10000"/>
          <bitfield name="subsys_xtal_ready_delay" caption="subsys_xtal_ready_delay" mask="0xF000"/>
          <bitfield name="subsys_bypass_pll_lock" caption="subsys_bypass_pll_lock" mask="0x200"/>
          <bitfield name="subsys_bypass_xtal_ready" caption="subsys_bypass_xtal_ready" mask="0x100"/>
          <bitfield name="ssubsys_clk_div_sel" caption="subsys_clk_div_sel" mask="0xC0"/>
          <bitfield name="subsys_clk_src_sel" caption="subsys_clk_src_sel" mask="0x30"/>
          <bitfield name="subsys_dbg_bus_sel" caption="subsys_dbg_bus_sel" mask="0xC"/>
          <bitfield name="subsys_dbg_bus_sel_top" caption="subsys_dbg_bus_sel_top" mask="0x3"/>
        </register>
        <register name="SUBSYS_STATUS_REG0" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG0">
          <bitfield name="bt_rf_idle" caption="bt_rf_idle" mask="0x20000"/>
          <bitfield name="bt_low_power_mode" caption="bt_low_power_mode" mask="0x10000"/>
          <bitfield name="radio_idle_zb" caption="radio_idle_zb" mask="0x4"/>
          <bitfield name="zb_deep_sleep_mode" caption="zb_deep_sleep_mode" mask="0x2"/>
          <bitfield name="zb_sleep_mode" caption="zb_sleep_mode" mask="0x1"/>
        </register>
        <register name="SUBSYS_STATUS_REG1" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG1">
          <bitfield name="clk_lp_ready" caption="clk_lp_ready" mask="0x10"/>
          <bitfield name="PLL_locked" caption="PLL_locked" mask="0x8"/>
          <bitfield name="XTAL_ready" caption="XTAL_ready" mask="0x4"/>
          <bitfield name="pll_lock_out" caption="pll_lock_out" mask="0x2"/>
          <bitfield name="xtal_ready_out" caption="xtal_ready_out" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="CCL" id="U2225" version="1.1.0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="2" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
