Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="MEN" offset="0x2C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Enable Register">
          <bitfield name="MENABLE" caption="Cache Controller Monitor Enable" mask="0x1"/>
        </register>
        <register name="MCTRL" offset="0x30" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Control Register">
          <bitfield name="SWRST" caption="Cache Controller Software Reset" mask="0x1"/>
        </register>
        <register name="MSR" offset="0x34" rw="R" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Status Register">
          <bitfield name="EVENT_CNT" caption="Monitor Event Counter" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CMCC_TYPE__CLSIZE">
        <value name="CLSIZE_4B" caption="Cache Line Size is 4 bytes" value="0"/>
        <value name="CLSIZE_8B" caption="Cache Line Size is 8 bytes" value="1"/>
        <value name="CLSIZE_16B" caption="Cache Line Size is 16 bytes" value="2"/>
        <value name="CLSIZE_32B" caption="Cache Line Size is 32 bytes" value="3"/>
        <value name="CLSIZE_64B" caption="Cache Line Size is 64 bytes" value="4"/>
        <value name="CLSIZE_128B" caption="Cache Line Size is 128 bytes" value="5"/>
      </value-group>
      <value-group name="CMCC_TYPE__CSIZE">
        <value name="CSIZE_1KB" caption="Cache Size is 1 KB" value="0"/>
        <value name="CSIZE_2KB" caption="Cache Size is 2 KB" value="1"/>
        <value name="CSIZE_4KB" caption="Cache Size is 4 KB" value="2"/>
        <value name="CSIZE_8KB" caption="Cache Size is 8 KB" value="3"/>
        <value name="CSIZE_16KB" caption="Cache Size is 16 KB" value="4"/>
        <value name="CSIZE_32KB" caption="Cache Size is 32 KB" value="5"/>
        <value name="CSIZE_64KB" caption="Cache Size is 64 KB" value="6"/>
      </value-group>
      <value-group name="CMCC_TYPE__WAYNUM">
        <value name="DMAPPED" caption="Direct Mapped Cache" value="0"/>
        <value name="ARCH2WAY" caption="2-WAY set associative" value="1"/>
        <value name="ARCH4WAY" caption="4-WAY set associative" value="2"/>
      </value-group>
      <value-group name="CMCC_CFG__CSIZESW">
        <value name="CONF_CSIZE_1KB" caption="The Cache Size is configured to 1KB" value="0"/>
        <value name="CONF_CSIZE_2KB" caption="The Cache Size is configured to 2KB" value="1"/>
        <value name="CONF_CSIZE_4KB" caption="The Cache Size is configured to 4KB" value="2"/>
        <value name="CONF_CSIZE_8KB" caption="The Cache Size is configured to 8KB" value="3"/>
        <value name="CONF_CSIZE_16KB" caption="The Cache Size is configured to 16KB" value="4"/>
        <value name="CONF_CSIZE_32KB" caption="The Cache Size is configured to 32KB" value="5"/>
        <value name="CONF_CSIZE_64KB" caption="The Cache Size is configured to 64KB" value="6"/>
      </value-group>
      <value-group name="CMCC_MAINT1__WAY">
        <value name="WAY0" caption="Way 0 is selection for index invalidation" value="0"/>
        <value name="WAY1" caption="Way 1 is selection for index invalidation" value="1"/>
        <value name="WAY2" caption="Way 2 is selection for index invalidation" value="2"/>
        <value name="WAY3" caption="Way 3 is selection for index invalidation" value="3"/>
      </value-group>
      <value-group name="CMCC_MCFG__MODE">
        <value name="CYCLE_COUNT" caption="Cycle counter" value="0"/>
        <value name="IHIT_COUNT" caption="Instruction hit counter" value="1"/>
        <value name="DHIT_COUNT" caption="Data hit counter" value="2"/>
      </value-group>
    </module>
    <module name="CRU" id="03100" version="1.0" caption="">
      <register-group name="CRU" caption="">
        <register caption="CRU OSCILLATOR CONTROL REGISTER" initval="0x000100" name="OSCCON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN"/>
          <bitfield caption="32 kHz Secondary (LP) Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN"/>
          <bitfield caption="Clock Fail Detect bit (Read / writable / Clearable by application)" mask="0x00000008" name="CF" values="OSCCON__CF"/>
          <bitfield caption="Enable SLEEP Mode bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN"/>
          <bitfield caption="Clock Lock Enabled bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK"/>
          <bitfield caption="New Oscillator Selection bits" mask="0x00000F00" name="NOSC" values="OSCCON__NOSC"/>
          <bitfield caption="Current Oscillator Selection bits (Read-only)" mask="0x0000F000" name="COSC" values="OSCCON__COSC"/>
          <bitfield caption="2-Speed startup enabled in Sleep mode bit" mask="0x00200000" name="WAKE2SPD" values="OSCCON__WAKE2SPD"/>
          <bitfield caption="Enable Dream Mode bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN"/>
          <bitfield caption="Fast RC Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV"/>
        </register>
        <register caption="" name="OSCCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x04"> </register>
        <register caption="" name="OSCCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x08"> </register>
        <register caption="" name="OSCCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x0C"> </register>
        <register caption="CRU OSCILLATOR TRIMMING REGISTER" initval="0x0" name="OSCTUN" offset="0x10" rw="RW" size="4">
          <bitfield caption="Internal Fast RC (FRC) Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN"/>
        </register>
        <register caption="" name="OSCTUNCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x14"> </register>
        <register caption="" name="OSCTUNSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x18"> </register>
        <register caption="" name="OSCTUNINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1C"> </register>
        <register caption="SPLL CONTROL REGISTER" initval="0xC0000108" name="SPLLCON" offset="0x20" rw="RW" size="4">
          <bitfield caption="PLL Power Down Register bit" mask="0x00000008" name="SPLLPWDN" values="SPLLCON__SPLLPWDN"/>
          <bitfield caption="System PLL Force Lock" mask="0x00000010" name="SPLLFLOCK" values="SPLLCON__SPLLFLOCK"/>
          <bitfield caption="System PLL Reset" mask="0x00000020" name="SPLLRST" values="SPLLCON__SPLLRST"/>
          <bitfield caption="SPLL Clock 1 Divide Value, 1 to 255" mask="0x0000FF00" name="SPLLPOSTDIV1"/>
          <bitfield caption="SPLL Clock 2 Divide Value, 1 to 15" mask="0x000F0000" name="SPLLPOSTDIV2" values="SPLLCON__SPLLPOSTDIV2"/>
          <bitfield caption="SPLL Clock 2 Source" mask="0xC0000000" name="SPLL_BYP" values="SPLLCON__SPLL_BYP"/>
        </register>
        <register caption="" name="SPLLCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x24"> </register>
        <register caption="" name="SPLLCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x28"> </register>
        <register caption="" name="SPLLCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x2C"> </register>
        <register caption="REFERENCE OSCILLATOR 1 CONTROL REGISTER" initval="0x0" name="REFO1CON" offset="0x70" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO1CON__FRZ"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV"/>
        </register>
