Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register caption="" name="REFO5CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xf4"> </register>
        <register caption="" name="REFO5CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xf8"> </register>
        <register caption="" name="REFO5CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0xfC"> </register>
        <register caption="REFERENCE OSCILLATOR 5 TRIM REGISTER" initval="0x0" name="REFO5TRIM" offset="0x100" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO5TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO5TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x104"> </register>
        <register caption="" name="REFO5TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x108"> </register>
        <register caption="" name="REFO5TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x10C"> </register>
        <register caption="REFERENCE OSCILLATOR 6 CONTROL REGISTER" initval="0x0" name="REFO6CON" offset="0x110" rw="RW" size="4">
          <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO6CON__ROSEL"/>
          <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO6CON__ACTIVE"/>
          <bitfield caption="Clock RODIV/ROTRIM switch enabled." mask="0x00000200" name="DIVSWEN" values="REFO6CON__DIVSWEN"/>
          <bitfield caption="Reference Oscillator Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO6CON__RSLP"/>
          <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO6CON__OE"/>
          <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO6CON__SIDL"/>
          <bitfield caption="Freeze in Debug mode bit" mask="0x4000" name="FRZ" values="REFO6CON__FRZ"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO6CON__ON"/>
          <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO6CON__RODIV"/>
        </register>
        <register caption="" name="REFO6CONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x114"> </register>
        <register caption="" name="REFO6CONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x118"> </register>
        <register caption="" name="REFO6CONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x11C"> </register>
        <register caption="REFERENCE OSCILLATOR 6 TRIM REGISTER" initval="0x0" name="REFO6TRIM" offset="0x120" rw="RW" size="4">
          <bitfield caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" mask="0xFF800000" name="ROTRIM" values="REFO6TRIM__ROTRIM"/>
        </register>
        <register caption="" name="REFO6TRIMCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x124"> </register>
        <register caption="" name="REFO6TRIMSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x128"> </register>
        <register caption="" name="REFO6TRIMINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x12C"> </register>
        <register caption="PB1 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB1DIV" offset="0x130" rw="RW" size="4">
          <bitfield caption="PB1 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB1DIV__PBDIV"/>
          <bitfield caption="PB1 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB1DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB1DIV__PBDIVON"/>
        </register>
        <register caption="PB2 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB2DIV" offset="0x140" rw="RW" size="4">
          <bitfield caption="PB2 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB2DIV__PBDIV"/>
          <bitfield caption="PB2 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB2DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB2DIV__PBDIVON"/>
        </register>
        <register caption="PB3 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB3DIV" offset="0x150" rw="RW" size="4">
          <bitfield caption="PB3 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB3DIV__PBDIV"/>
          <bitfield caption="PB3 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB3DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB3DIV__PBDIVON"/>
        </register>
        <register caption="" name="PB1DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x134"> </register>
        <register caption="" name="PB1DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x138"> </register>
        <register caption="" name="PB1DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x13C"> </register>
        <register caption="" name="PB2DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x144"> </register>
        <register caption="" name="PB2DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x148"> </register>
        <register caption="" name="PB2DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x14C"> </register>
        <register caption="" name="PB3DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x154"> </register>
        <register caption="" name="PB3DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x158"> </register>
        <register caption="" name="PB3DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x15C"> </register>
        <register caption="SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER" initval="0x0" name="SLEWCON" offset="0x160" rw="RW" size="4">
          <bitfield caption="Clock Switch Slewing Active Status Bit - Read-Only" mask="0x00000001" name="BUSY" values="SLEWCON__BUSY"/>
          <bitfield caption="Clock slew enable for switching down to slower clocks" mask="0x00000002" name="DNEN" values="SLEWCON__DNEN"/>
          <bitfield caption="Clock slew enable for switching up to faster clocks" mask="0x00000004" name="UPEN" values="SLEWCON__UPEN"/>
          <bitfield caption="Divisor steps used when doing slewed clock switches" mask="0x00000700" name="SLWDIV" values="SLEWCON__SLWDIV"/>
          <bitfield caption="PBx Peripheral Clock Divisor Control value" mask="0x000F0000" name="SYSDIV" values="SLEWCON__SYSDIV"/>
          <bitfield caption="Number of clocks generated at each slew step for a clock switch" mask="0x0F000000" name="SLWDLY" values="SLEWCON__SLWDLY"/>
        </register>
