Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
      <value-group caption="System PLL3 Ready Status value" name="CLKSTAT__SPLL3RDY">
        <value caption="SPLL3 Output is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="SPLL3 Output is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="POSC Clock Stop Control value" name="CLKDIAG__POSCSTOP">
        <value caption="POSC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="POSC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Clock Stop Control value" name="CLKDIAG__SOSCSTOP">
        <value caption="SOSC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SOSC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="FRC Clock Stop Control value" name="CLKDIAG__FRCSTOP">
        <value caption="FRC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="FRC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Clock Stop Control value" name="CLKDIAG__LPRCSTOP">
        <value caption="LPRC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="LPRC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SPLL1 Clock Stop Control value" name="CLKDIAG__SPLL1STOP">
        <value caption="SPLL1 clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SPLL1 clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SPLL2 Clock Stop Control value" name="CLKDIAG__SPLL2STOP">
        <value caption="SPLL2 clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SPLL2 clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SPLL3 Clock Stop Control value" name="CLKDIAG__SPLL3STOP">
        <value caption="SPLL3 clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SPLL3 clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
    </module>
    <module name="RCON" id="03100" version="1.0" caption="">
      <register-group name="RCON" caption="">
        <register caption="RESET CONTROL REGISTER" initval="0x3" name="RCON" offset="0x30" rw="RW" size="4">
          <bitfield caption="Power-On Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR"/>
          <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR"/>
          <bitfield caption="Wake from Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE"/>
          <bitfield caption="Wake from Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP"/>
          <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO"/>
          <bitfield caption="Deadman Timer Time-Out Flag bit" mask="0x00000020" name="DMTO" values="RCON__DMTO"/>
          <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR"/>
          <bitfield caption="External Reset (MCLR) Status bit" mask="0x00000080" name="EXTR" values="RCON__EXTR"/>
          <bitfield caption="Configuration Mismatch Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR"/>
          <bitfield caption="DPSLP Deep Sleep Mode Flag Bit" mask="0x00000400" name="DPSLP" values="RCON__DPSLP"/>
          <bitfield caption="NVM End of Life Flag Bit" mask="0x01000000" name="NVMEOL" values="RCON__NVMEOL"/>
          <bitfield caption="NVM Life Time Alert Flag Bit" mask="0x02000000" name="NVMLTA" values="RCON__NVMLTA"/>
          <bitfield caption="BCFG Failure Flag Bit" mask="0x04000000" name="BCFGFAIL" values="RCON__BCFGFAIL"/>
          <bitfield caption="BCFG Error Flag Bit" mask="0x08000000" name="BCFGERR" values="RCON__BCFGERR"/>
          <bitfield caption="Core Voltage POR Flag bit" mask="0x40000000" name="PORCORE" values="RCON__PORCORE"/>
          <bitfield caption="IO Voltage POR Flag bit" mask="0x80000000" name="PORIO" values="RCON__PORIO"/>
        </register>
        <register caption="" name="RCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x34"> </register>
        <register caption="" name="RCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x38"> </register>
        <register caption="" name="RCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x3C"> </register>
        <register caption="SOFTWARE RESET REGISTER" initval="0x0" name="RSWRST" offset="0x40" rw="W" size="4">
          <bitfield caption="Software Reset Trigger" mask="0x00000001" name="SWRST" values="RSWRST__SWRST"/>
        </register>
        <register caption="" name="RSWRSTCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x44"> </register>
        <register caption="" name="RSWRSTSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x48"> </register>
        <register caption="" name="RSWRSTINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x4C"> </register>
        <register caption="NMI CONTROL REGISTER" initval="0x0" name="RNMICON" offset="0x50" rw="RW" size="4">
          <bitfield caption="NMI Reset counter value" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT"/>
          <bitfield caption="Watch-Dog Timer Time-Out in Sleep Flag bit" mask="0x00010000" name="WDTS" values="RNMICON__WDTS"/>
          <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF"/>
          <bitfield caption="Programmable Low Voltage Detect Event" mask="0x00040000" name="LVD" values="RNMICON__LVD"/>
          <bitfield caption="External / Generic NMI Event" mask="0x00080000" name="GNMI" values="RNMICON__GNMI"/>
          <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI"/>
          <bitfield caption="Watchdog Timer Time-Out in Run Flag bit" mask="0x01000000" name="WDTR" values="RNMICON__WDTR"/>
          <bitfield caption="Deadman Timer Time-Out Flag bit" mask="0x02000000" name="DMTO" values="RNMICON__DMTO"/>
        </register>
