Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="NVMUBWP" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="UBWP0" caption="" mask="0x1"/>
          <bitfield name="UBWP1" caption="" mask="0x2"/>
          <bitfield name="UBWP2" caption="" mask="0x4"/>
          <bitfield name="UBWP3" caption="" mask="0x8"/>
          <bitfield name="UBWP4" caption="" mask="0x10"/>
          <bitfield name="UBWP5" caption="" mask="0x20"/>
          <bitfield name="UBWP6" caption="" mask="0x40"/>
          <bitfield name="UBWP7" caption="" mask="0x80"/>
          <bitfield name="UBWP8" caption="" mask="0x100"/>
          <bitfield name="UBWP9" caption="" mask="0x200"/>
          <bitfield name="UBWP10" caption="" mask="0x400"/>
          <bitfield name="UBWP11" caption="" mask="0x800"/>
          <bitfield name="UBWP12" caption="" mask="0x1000"/>
          <bitfield name="UBWP13" caption="" mask="0x2000"/>
          <bitfield name="UBWP14" caption="" mask="0x4000"/>
          <bitfield name="UBWP15" caption="" mask="0x8000"/>
          <bitfield name="UBWP16" caption="" mask="0x10000"/>
          <bitfield name="UBWP17" caption="" mask="0x20000"/>
          <bitfield name="UBWP18" caption="" mask="0x40000"/>
          <bitfield name="UBWP19" caption="" mask="0x80000"/>
          <bitfield name="UBWP20" caption="" mask="0x100000"/>
          <bitfield name="UBWP21" caption="" mask="0x200000"/>
          <bitfield name="UBWP22" caption="" mask="0x400000"/>
          <bitfield name="UBWP23" caption="" mask="0x800000"/>
          <bitfield name="ULOCK" caption="" mask="0x80000000"/>
        </register>
        <register name="NVMUBWPCLR" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMUBWPSET" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="NVMUBWPINV" offset="0x10C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
      </register-group>
    </module>
    <module name="FREQM" id="U2257" version="1.1.0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="FUSES" id="U2409" version="1.0.0" caption="Non-Volatile Fuses">
      <register-group name="USER_FUSES">
        <register name="FBCFG7" initval="0xFFFFFFFF" offset="0x100" size="4" rw="RW" caption="RESERVED"/>
        <register name="FBCFG6" initval="0xFFFFFFFF" offset="0x104" size="4" rw="RW" caption="RESERVED"/>
        <register name="FUSERID" initval="0x0000FFFF" offset="0x108" size="4" rw="RW" caption="USER Page USERID">
          <bitfield name="USER_ID" caption="User unique ID, readable using the JTAG USER_ID instruction" mask="0xffff"/>
        </register>
        <register name="DEVCFG4" initval="0x840e4000" offset="0x10C" size="4" rw="RW" caption="USER Page CFGCON4 Fuses">
          <bitfield name="SOSCCFG" caption="SOSC Configuration" mask="0xff"/>
          <bitfield name="RTCEVENT_SEL" caption="RTC Event Selection" mask="0x300" values="DEVCFG4__RTCEVENT_SEL"/>
          <bitfield name="RTCEVENT_EN" caption="Pad Output Enable for MCHP legacy RTC event output" mask="0x400" values="DEVCFG4__RTCEVENT_EN"/>
          <bitfield name="VBKP_1KCSEL" caption="VDDBUKPCORE LPCLK Clock Selection" mask="0x800" values="DEVCFG4__VBKP_1KCSEL"/>
          <bitfield name="VBKP_32KCSEL" caption="VDDBUKPCORE 32kHz clock source selection" mask="0x3000" values="DEVCFG4__VBKP_32KCSEL"/>
          <bitfield name="VBKP_DIVSEL" caption="VDDBUKPCORE LPCLK Clock Divider Selection" mask="0x4000" values="DEVCFG4__VBKP_DIVSEL"/>
          <bitfield name="LPCLK_MOD" caption="LPCLK modifier in counter/delay mode" mask="0x8000" values="DEVCFG4__LPCLK_MOD"/>
          <bitfield name="RTCEVTYPE" caption="RTC Event Type" mask="0x10000" values="DEVCFG4__RTCEVTYPE"/>
          <bitfield name="CPEN_DLY" caption="Charge-pump ready digital delay" mask="0xe0000" values="DEVCFG4__CPEN_DLY"/>
          <bitfield name="DSZPBOREN" caption="Deep Sleep Zero-Power BOR Enable" mask="0x100000" values="DEVCFG4__DSZPBOREN"/>
          <bitfield name="DSWDTPS" caption="Deep Sleep Watchdog Timer Postscale Select" mask="0x3e00000" values="DEVCFG4__DSWDTPS"/>
          <bitfield name="DSWDTOSC" caption="Deep Sleep Watchdog Timer Reference Clock Select" mask="0x4000000" values="DEVCFG4__DSWDTOSC"/>
          <bitfield name="DSWDTEN" caption="Deep Sleep Watchdog Timer Enable" mask="0x8000000" values="DEVCFG4__DSWDTEN"/>
          <bitfield name="DSEN" caption="Deep Sleep Bit Enable" mask="0x10000000" values="DEVCFG4__DSEN"/>
          <bitfield name="UVREGROVR" caption="ULPVREG Retention Mode Override" mask="0x20000000" values="DEVCFG4__UVREGROVR"/>
          <bitfield name="RTCNTM_CSEL" caption="RTC Counter Mode Clock Select" mask="0x80000000" values="DEVCFG4__RTCNTM_CSEL"/>
        </register>
        <register name="DEVCFG2" initval="0x5f74ff38" offset="0x110" size="4" rw="RW" caption="USER Page CFGCON2 Fuses">
          <bitfield name="ACMP_CYCLE" caption="AC Comparator Result Wait Cycles" mask="0x7" values="DEVCFG2__ACMP_CYCLE"/>
          <bitfield name="DMTINTV" caption="Dead Man Timer Count Window Interval" mask="0x38" values="DEVCFG2__DMTINTV"/>
          <bitfield name="PMUTEST_VDD_EN" caption="PMU Test Output or VDD/2 Enable via ADC IE12" mask="0x80" values="DEVCFG2__PMUTEST_VDD_EN"/>
          <bitfield name="POSCMOD" caption="Primary Oscillator Configuration" mask="0x300" values="DEVCFG2__POSCMOD"/>
          <bitfield name="WDTRMCS" caption="WDT RUN Mode Clock Select" mask="0xc00" values="DEVCFG2__WDTRMCS"/>
          <bitfield name="SOSCSEL" caption="SOSC Selection Configuration" mask="0x1000" values="DEVCFG2__SOSCSEL"/>
          <bitfield name="WAKE2SPD" caption="2-Speed startup enabled in Sleep mode" mask="0x2000" values="DEVCFG2__WAKE2SPD"/>
          <bitfield name="CKSWEN" caption="Software Clock Switching Enable" mask="0x4000" values="DEVCFG2__CKSWEN"/>
          <bitfield name="FSCMEN" caption="Fail-Safe Clock Monitor Enable" mask="0x8000" values="DEVCFG2__FSCMEN"/>
          <bitfield name="WDTPSR" caption="Watchdog Timer Post-scale Select Run" mask="0x1f0000" values="DEVCFG2__WDTPSR"/>
          <bitfield name="WDTSPGM" caption="Watchdog Timer Stop during Flash Programming" mask="0x200000" values="DEVCFG2__WDTSPGM"/>
          <bitfield name="WINDIS" caption="Windowed Watchdog Timer Disable" mask="0x400000" values="DEVCFG2__WINDIS"/>
          <bitfield name="WDTEN" caption="Watchdog Timer Enable" mask="0x800000" values="DEVCFG2__WDTEN"/>
          <bitfield name="WDTWINSZ" caption="Watchdog Timer Window Size" mask="0x3000000" values="DEVCFG2__WDTWINSZ"/>
          <bitfield name="DMTCNT" caption="Dead Man Timer Count Select" mask="0x7c000000" values="DEVCFG2__DMTCNT"/>
          <bitfield name="DMTEN" caption="Dead Man Timer Enable" mask="0x80000000" values="DEVCFG2__DMTEN"/>
        </register>
