Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="LATSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="LATINV" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ODC" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ODC0" caption="" mask="0x1"/>
          <bitfield name="ODC1" caption="" mask="0x2"/>
          <bitfield name="ODC2" caption="" mask="0x4"/>
          <bitfield name="ODC3" caption="" mask="0x8"/>
          <bitfield name="ODC4" caption="" mask="0x10"/>
          <bitfield name="ODC5" caption="" mask="0x20"/>
          <bitfield name="ODC6" caption="" mask="0x40"/>
          <bitfield name="ODC7" caption="" mask="0x80"/>
          <bitfield name="ODC8" caption="" mask="0x100"/>
          <bitfield name="ODC9" caption="" mask="0x200"/>
          <bitfield name="ODC10" caption="" mask="0x400"/>
          <bitfield name="ODC11" caption="" mask="0x800"/>
          <bitfield name="ODC12" caption="" mask="0x1000"/>
          <bitfield name="ODC13" caption="" mask="0x2000"/>
          <bitfield name="ODC14" caption="" mask="0x4000"/>
        </register>
        <register name="ODCCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ODCSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="ODCINV" offset="0x4C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPU" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNPU0" caption="" mask="0x1"/>
          <bitfield name="CNPU1" caption="" mask="0x2"/>
          <bitfield name="CNPU2" caption="" mask="0x4"/>
          <bitfield name="CNPU3" caption="" mask="0x8"/>
          <bitfield name="CNPU4" caption="" mask="0x10"/>
          <bitfield name="CNPU5" caption="" mask="0x20"/>
          <bitfield name="CNPU6" caption="" mask="0x40"/>
          <bitfield name="CNPU7" caption="" mask="0x80"/>
          <bitfield name="CNPU8" caption="" mask="0x100"/>
          <bitfield name="CNPU9" caption="" mask="0x200"/>
          <bitfield name="CNPU10" caption="" mask="0x400"/>
          <bitfield name="CNPU11" caption="" mask="0x800"/>
          <bitfield name="CNPU12" caption="" mask="0x1000"/>
          <bitfield name="CNPU13" caption="" mask="0x2000"/>
          <bitfield name="CNPU14" caption="" mask="0x4000"/>
        </register>
        <register name="CNPUCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPUSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPUINV" offset="0x5C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPD" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNPD0" caption="" mask="0x1"/>
          <bitfield name="CNPD1" caption="" mask="0x2"/>
          <bitfield name="CNPD2" caption="" mask="0x4"/>
          <bitfield name="CNPD3" caption="" mask="0x8"/>
          <bitfield name="CNPD4" caption="" mask="0x10"/>
          <bitfield name="CNPD5" caption="" mask="0x20"/>
          <bitfield name="CNPD6" caption="" mask="0x40"/>
          <bitfield name="CNPD7" caption="" mask="0x80"/>
          <bitfield name="CNPD8" caption="" mask="0x100"/>
          <bitfield name="CNPD9" caption="" mask="0x200"/>
          <bitfield name="CNPD10" caption="" mask="0x400"/>
          <bitfield name="CNPD11" caption="" mask="0x800"/>
          <bitfield name="CNPD12" caption="" mask="0x1000"/>
          <bitfield name="CNPD13" caption="" mask="0x2000"/>
          <bitfield name="CNPD14" caption="" mask="0x4000"/>
        </register>
        <register name="CNPDCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPDSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNPDINV" offset="0x6C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCON" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EDGEDETECT" caption="" mask="0x800"/>
          <bitfield name="SIDL" caption="" mask="0x2000"/>
          <bitfield name="FRZ" caption="" mask="0x4000"/>
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="CNCONCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCONSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCONINV" offset="0x7C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNEN" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNIE0" caption="" mask="0x1"/>
          <bitfield name="CNIE1" caption="" mask="0x2"/>
          <bitfield name="CNIE2" caption="" mask="0x4"/>
          <bitfield name="CNIE3" caption="" mask="0x8"/>
          <bitfield name="CNIE4" caption="" mask="0x10"/>
          <bitfield name="CNIE5" caption="" mask="0x20"/>
          <bitfield name="CNIE6" caption="" mask="0x40"/>
          <bitfield name="CNIE7" caption="" mask="0x80"/>
          <bitfield name="CNIE8" caption="" mask="0x100"/>
          <bitfield name="CNIE9" caption="" mask="0x200"/>
          <bitfield name="CNIE10" caption="" mask="0x400"/>
          <bitfield name="CNIE11" caption="" mask="0x800"/>
          <bitfield name="CNIE12" caption="" mask="0x1000"/>
          <bitfield name="CNIE13" caption="" mask="0x2000"/>
          <bitfield name="CNIE14" caption="" mask="0x4000"/>
        </register>
        <register name="CNENCLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
