Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
      <value-group name="ICM_RCFG__BEIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__CDWBN">
        <value name="WRBA" value="0"/>
        <value name="COMP" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__DMIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ECIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__EOM">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__PROCDLY">
        <value name="SHORT" value="0"/>
        <value name="LONG" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WRAP">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_UASR__URAT">
        <value name="UNSPEC_STRUCT_MEMBER" caption="Unspecified structure member set to one detected when the descriptor is loaded" value="0x0"/>
        <value name="CFG_MODIFIED" caption="CFG modified during active monitoring" value="0x1"/>
        <value name="DSCR_MODIFIED" caption="DSCR modified during active monitoring" value="0x2"/>
        <value name="HASH_MODIFIED" caption="HASH modified during active monitoring" value="0x3"/>
        <value name="READ_ACCESS" caption="Write-only register read access" value="0x4"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="1.2.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="SRAM0_" caption="SRAM0" mask="0x1"/>
          <bitfield name="SRAM1_" caption="SRAM1" mask="0x2"/>
          <bitfield name="SRAM2_" caption="SRAM2" mask="0x4"/>
          <bitfield name="SRAM3_" caption="SRAM3" mask="0x8"/>
          <bitfield name="CFLASH_" caption="CFLASH" mask="0x10"/>
          <bitfield name="PFLASH_" caption="PFLASH" mask="0x20"/>
          <bitfield name="HPBA_" caption="HPBA" mask="0x40"/>
          <bitfield name="HPBB_" caption="HPBB" mask="0x80"/>
          <bitfield name="HPBC_" caption="HPBC" mask="0x100"/>
          <bitfield name="HPBPIC_" caption="HPBPIC0" mask="0x200"/>
          <bitfield name="QSPI_" caption="QSPI" mask="0x400"/>
          <bitfield name="PUKCC_" caption="PUKCC" mask="0x800"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3" mask="0x100"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x800"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="DSU_" caption="DSU" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC" mask="0x10"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI" mask="0x1"/>
          <bitfield name="AES_" caption="AES" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x10"/>
          <bitfield name="CCL_" caption="CCL" mask="0x40"/>
          <bitfield name="AC_" caption="AC" mask="0x80"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x400"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00010000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x100"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x800"/>
        </register>
