Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="PMU_VBCWDATA" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCWDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="PMU_VBCRDATA" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCRDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="WCMCFG" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WCM1CFG" caption="" mask="0x7"/>
          <bitfield name="WCM2CFG" caption="" mask="0x70"/>
        </register>
        <register name="PMUIENB" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORIEN" caption="" mask="0x1"/>
          <bitfield name="BUCKBORIEN" caption="" mask="0x2"/>
          <bitfield name="SCMPIEN" caption="" mask="0x4"/>
          <bitfield name="WCMIAIEN" caption="" mask="0x8"/>
          <bitfield name="VBCIAIEN" caption="" mask="0x10"/>
        </register>
        <register name="PMUISTAT" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORINT" caption="" mask="0x1"/>
          <bitfield name="BUCKBORINT" caption="" mask="0x2"/>
          <bitfield name="SCMPINT" caption="" mask="0x4"/>
          <bitfield name="WCMIAINT" caption="" mask="0x8"/>
          <bitfield name="VBCIAINT" caption="" mask="0x10"/>
        </register>
      </register-group>
    </module>
    <!-- THIS IS FOR 48-PIN DEVICE ONLY -->
    <module name="PPS" id="U148" version="1.0" caption="PPS">
      <register-group name="PPS" caption="'PPS">
        <!-- Next lines are INPUT function pin mappings -->
        <register name="EXTINT0R" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT0" caption="EXTINT0" mask="0xf" values="EXTINT0_PINS"/>
        </register>
        <register name="EXTINT1R" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT1" caption="EXTINT1" mask="0xf" values="EXTINT1_PINS"/>
        </register>
        <register name="EXTINT2R" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT2" caption="EXTINT2" mask="0xf" values="EXTINT2_PINS"/>
        </register>
        <register name="EXTINT3R" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT3" caption="EXTINT3" mask="0xf" values="EXTINT3_PINS"/>
        </register>
        <register name="NMIR" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NMI" caption="NMI" mask="0xf" values="NMI_PINS"/>
        </register>
        <register name="SCOM0P0R" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P0" caption="SERCOM0/PAD0" mask="0xf" values="SCOM0P0_PINS"/>
        </register>
        <register name="SCOM0P1R" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P1" caption="SERCOM0/PAD1" mask="0xf" values="SCOM0P1_PINS"/>
        </register>
        <register name="SCOM0P2R" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P2" caption="SERCOM0/PAD2" mask="0xf" values="SCOM0P2_PINS"/>
        </register>
        <register name="SCOM0P3R" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P3" caption="SERCOM0/PAD3" mask="0xf" values="SCOM0P3_PINS"/>
        </register>
        <register name="SCOM1P0R" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P0" caption="SERCOM1/PAD0" mask="0xf" values="SCOM1P0_PINS"/>
        </register>
        <register name="SCOM1P1R" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P1" caption="SERCOM1/PAD1" mask="0xf" values="SCOM1P1_PINS"/>
        </register>
        <register name="SCOM1P2R" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P2" caption="SERCOM1/PAD2" mask="0xf" values="SCOM1P2_PINS"/>
        </register>
        <register name="SCOM1P3R" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P3" caption="SERCOM1/PAD3" mask="0xf" values="SCOM1P3_PINS"/>
        </register>
        <register name="SCOM2P0R" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P0" caption="SERCOM2/PAD0" mask="0xf" values="SCOM2P0_PINS"/>
        </register>
        <register name="SCOM2P1R" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P1" caption="SERCOM2/PAD1" mask="0xf" values="SCOM2P1_PINS"/>
        </register>
        <register name="SCOM2P2R" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P2" caption="SERCOM2/PAD2" mask="0xf" values="SCOM2P2_PINS"/>
        </register>
        <register name="SCOM2P3R" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P3" caption="SERCOM2/PAD3" mask="0xf" values="SCOM2P3_PINS"/>
        </register>
        <register name="SCOM3P0R" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P0" caption="SERCOM3/PAD0" mask="0xf" values="SCOM3P0_PINS"/>
        </register>
        <register name="SCOM3P1R" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P1" caption="SERCOM3/PAD1" mask="0xf" values="SCOM3P1_PINS"/>
        </register>
