Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="SCOM3P2R" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P2" caption="SERCOM3/PAD2" mask="0xf" values="SCOM3P2_PINS"/>
        </register>
        <register name="SCOM3P3R" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P3" caption="SERCOM3/PAD3" mask="0xf" values="SCOM3P3_PINS"/>
        </register>
        <register name="QSCKR" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QSCK" caption="QSPI/SCK" mask="0xf" values="QSCK_PINS"/>
        </register>
        <register name="QD0R" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD0" caption="QSPI/DATA0" mask="0xf" values="QD0_PINS"/>
        </register>
        <register name="QD1R" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD1" caption="QSPI/DATA1" mask="0xf" values="QD1_PINS"/>
        </register>
        <register name="QD2R" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD2" caption="QSPI/DATA2" mask="0xf" values="QD2_PINS"/>
        </register>
        <register name="QD3R" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD3" caption="QSPI/DATA3" mask="0xf" values="QD3_PINS"/>
        </register>
        <register name="REFIR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFI" caption="REFI" mask="0xf" values="REFI_PINS"/>
        </register>
        <register name="CCLIN0R" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN0" caption="CCL/IN0" mask="0xf" values="CCLIN0_PINS"/>
        </register>
        <register name="CCLIN1R" offset="0x9c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN1" caption="CCL/IN1" mask="0xf" values="CCLIN1_PINS"/>
        </register>
        <register name="CCLIN2R" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN2" caption="CCL/IN2" mask="0xf" values="CCLIN2_PINS"/>
        </register>
        <register name="CCLIN3R" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN3" caption="CCL/IN3" mask="0xf" values="CCLIN3_PINS"/>
        </register>
        <register name="CCLIN4R" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN4" caption="CCL/IN4" mask="0xf" values="CCLIN4_PINS"/>
        </register>
        <register name="CCLIN5R" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN5" caption="CCL/IN5" mask="0xf" values="CCLIN5_PINS"/>
        </register>
        <register name="TC0WO0G1R" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G1" mask="0xf" values="TC0WO0G1_PINS"/>
        </register>
        <register name="TC0WO0G2R" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G2" mask="0xf" values="TC0WO0G2_PINS"/>
        </register>
        <register name="TC0WO1G3R" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G3" mask="0xf" values="TC0WO1G3_PINS"/>
        </register>
        <register name="TC0WO1G4R" offset="0xbc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G4" mask="0xf" values="TC0WO1G4_PINS"/>
        </register>
        <register name="TC1WO0G1R" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO0" caption="TC1/WO0G1" mask="0xf" values="TC1WO0G1_PINS"/>
        </register>
        <register name="TC1WO1G2R" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO1" caption="TC1/WO1G2" mask="0xf" values="TC1WO1G2_PINS"/>
        </register>
        <register name="TC2WO0G1R" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G1" mask="0xf" values="TC2WO0G1_PINS"/>
        </register>
        <register name="TC2WO0G3R" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G3" mask="0xf" values="TC2WO0G3_PINS"/>
        </register>
        <register name="TC2WO1G2R" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G2" mask="0xf" values="TC2WO1G2_PINS"/>
        </register>
        <register name="TC2WO1G4R" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G4" mask="0xf" values="TC2WO1G4_PINS"/>
        </register>
        <register name="TC3WO0G1R" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G1" mask="0xf" values="TC3WO0G1_PINS"/>
        </register>
        <register name="TC3WO0G3R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G3" mask="0xf" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G2" mask="0xf" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G4" mask="0xf" values="TC3WO1G4_PINS"/>
        </register>
        <!-- Next lines are OUTPUT pin mappings -->
        <register name="RPA0G2R" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G2R" caption="RPA0/G2" mask="0x1f" values="RPA0G2_PINS"/>
        </register>
