Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
      <value-group name="RPB11G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="1"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="2"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="4"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="5"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="6"/>
        <value name="SCOM2P3" caption="SERCOM2/PAD3" value="7"/>
        <value name="SCOM2P0" caption="SERCOM2/PAD0" value="8"/>
        <value name="SCOM3P3" caption="SERCOM3/PAD3" value="9"/>
        <value name="SCOM3P2" caption="SERCOM3/PAD2" value="10"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="11"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="12"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="13"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="14"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="15"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="16"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="17"/>
        <value name="TC0WO0" caption="TC0/WO0" value="18"/>
        <value name="REFO4" caption="REFO4" value="19"/>
        <value name="TC1WO1" caption="TC1/WO1" value="20"/>
        <value name="TC2WO1" caption="TC2/WO1" value="21"/>
        <value name="TC3WO1" caption="TC3/WO1" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD2" caption="QD2" value="25"/>
        <value name="QD1" caption="QD1" value="26"/>
        <value name="QD0" caption="QD0" value="27"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="28"/>
        <value name="TSTBUS3" caption="TSTBUS3" value="29"/>
        <value name="TSTBUS7" caption="TSTBUS7" value="30"/>
        <value name="TSTBUS11" caption="TSTBUS11" value="31"/>
      </value-group>
      <value-group name="RPB12G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="1"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="2"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="3"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="4"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="5"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="6"/>
        <value name="SCOM2P0" caption="SERCOM2/PAD0" value="7"/>
        <value name="SCOM2P1" caption="SERCOM2/PAD1" value="8"/>
        <value name="SCOM3P0" caption="SERCOM3/PAD0" value="9"/>
        <value name="SCOM3P3" caption="SERCOM3/PAD3" value="10"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="11"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="12"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="13"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="14"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="15"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="REFO1" caption="REFO1" value="19"/>
        <value name="TC1WO0" caption="TC1/WO0" value="20"/>
        <value name="TC2WO0" caption="TC2/WO0" value="21"/>
        <value name="TC3WO0" caption="TC3/WO0" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD3" caption="QD3" value="25"/>
        <value name="QD2" caption="QD2" value="26"/>
        <value name="QD1" caption="QD1" value="27"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="28"/>
        <value name="TSTBUS0" caption="TSTBUS0" value="29"/>
        <value name="TSTBUS4" caption="TSTBUS4" value="30"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="31"/>
      </value-group>
      <value-group name="RPB12G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="1"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="2"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="3"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="4"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="5"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="6"/>
        <value name="SCOM2P1" caption="SERCOM2/PAD1" value="7"/>
        <value name="SCOM2P2" caption="SERCOM2/PAD2" value="8"/>
        <value name="SCOM3P1" caption="SERCOM3/PAD1" value="9"/>
        <value name="SCOM3P0" caption="SERCOM3/PAD0" value="10"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="11"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="12"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="13"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="14"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="15"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="16"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="REFO2" caption="REFO2" value="19"/>
        <value name="TC1WO1" caption="TC1/WO1" value="20"/>
        <value name="TC2WO1" caption="TC2/WO1" value="21"/>
        <value name="TC3WO1" caption="TC3/WO1" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD0" caption="QD0" value="25"/>
        <value name="QD3" caption="QD3" value="26"/>
        <value name="QD2" caption="QD2" value="27"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="28"/>
        <value name="TSTBUS1" caption="TSTBUS1" value="29"/>
        <value name="TSTBUS5" caption="TSTBUS5" value="30"/>
        <value name="TSTBUS9" caption="TSTBUS9" value="31"/>
      </value-group>
      <value-group name="RPB13G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="1"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="2"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="3"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="4"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="5"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="6"/>
        <value name="SCOM2P1" caption="SERCOM2/PAD1" value="7"/>
        <value name="SCOM2P2" caption="SERCOM2/PAD2" value="8"/>
        <value name="SCOM3P1" caption="SERCOM3/PAD1" value="9"/>
        <value name="SCOM3P0" caption="SERCOM3/PAD0" value="10"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="11"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="12"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="13"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="14"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="15"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="16"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="17"/>
        <value name="TC0WO1" caption="TC0/WO1" value="18"/>
        <value name="REFO2" caption="REFO2" value="19"/>
        <value name="TC1WO1" caption="TC1/WO1" value="20"/>
        <value name="TC2WO1" caption="TC2/WO1" value="21"/>
        <value name="TC3WO1" caption="TC3/WO1" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD0" caption="QD0" value="25"/>
        <value name="QD3" caption="QD3" value="26"/>
        <value name="QD2" caption="QD2" value="27"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="28"/>
        <value name="TSTBUS1" caption="TSTBUS1" value="29"/>
        <value name="TSTBUS5" caption="TSTBUS5" value="30"/>
        <value name="TSTBUS9" caption="TSTBUS9" value="31"/>
      </value-group>
      <value-group name="RPB13G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="1"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="2"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="3"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="4"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="5"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="6"/>
        <value name="SCOM2P2" caption="SERCOM2/PAD2" value="7"/>
        <value name="SCOM2P3" caption="SERCOM2/PAD3" value="8"/>
        <value name="SCOM3P2" caption="SERCOM3/PAD2" value="9"/>
        <value name="SCOM3P1" caption="SERCOM3/PAD1" value="10"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="11"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="12"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="13"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="14"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="15"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="16"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="17"/>
        <value name="TC0WO0" caption="TC0/WO0" value="18"/>
        <value name="REFO3" caption="REFO3" value="19"/>
        <value name="TC1WO0" caption="TC1/WO0" value="20"/>
        <value name="TC2WO0" caption="TC2/WO0" value="21"/>
        <value name="TC3WO0" caption="TC3/WO0" value="22"/>
        <value name="QSCK" caption="QSCK" value="23"/>
        <value name="QCS" caption="QCS" value="24"/>
        <value name="QD1" caption="QD1" value="25"/>
        <value name="QD0" caption="QD0" value="26"/>
        <value name="QD3" caption="QD3" value="27"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="28"/>
        <value name="TSTBUS2" caption="TSTBUS2" value="29"/>
        <value name="TSTBUS6" caption="TSTBUS6" value="30"/>
        <value name="TSTBUS10" caption="TSTBUS10" value="31"/>
      </value-group>
    </module>
    <module name="PUKCC" id="U2009" version="2.5.0" caption="PUblic-Key Cryptography Controller">
      <register-group name="PUKCC" caption="PUblic-Key Cryptography Controller"/>
    </module>
    <module name="QSPI" id="U2008" version="1.6.3" caption="Quad SPI interface">
      <register-group name="QSPI" caption="Quad SPI interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LASTXFER" caption="Last Transfer" mask="0x1000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="MODE" caption="Serial Memory Mode" mask="0x1" values="QSPI_CTRLB__MODE"/>
          <bitfield name="LOOPEN" caption="Local Loopback Enable" mask="0x2" values="QSPI_CTRLB__LOOPEN"/>
          <bitfield name="WDRBT" caption="Wait Data Read Before Transfer" mask="0x4"/>
          <bitfield name="SMEMREG" caption="Serial Memory reg" mask="0x8"/>
          <bitfield name="CSMODE" caption="Chip Select Mode" mask="0x30" values="QSPI_CTRLB__CSMODE"/>
          <bitfield name="DATALEN" caption="Data Length" mask="0xF00" values="QSPI_CTRLB__DATALEN"/>
          <bitfield name="DLYBCT" caption="Delay Between Consecutive Transfers" mask="0xFF0000"/>
          <bitfield name="DLYCS" caption="Minimum Inactive CS Delay" mask="0xFF000000"/>
        </register>
        <register name="BAUD" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Baud Rate">
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x1"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x2"/>
          <bitfield name="BAUD" caption="Serial Clock Baud Rate" mask="0xFF00"/>
          <bitfield name="DLYBS" caption="Delay Before SCK" mask="0xFF0000"/>
        </register>
        <register name="RXDATA" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Receive Data">
          <bitfield name="DATA" caption="Receive Data" mask="0xFFFF"/>
        </register>
        <register name="TXDATA" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Transmit Data">
          <bitfield name="DATA" caption="Transmit Data" mask="0xFFFF"/>
        </register>
