Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/WBZ451/atdf/WBZ451.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
    <module name="ZIGBEE" version="1.0.0" caption="ZIGBEE Radio Registers">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="LGA39" caption="LGA39">
      <pin position="1" pad="GND"/>
      <pin position="2" pad="GND"/>
      <pin position="3" pad="NMCLR"/>
      <pin position="4" pad="PB00"/>
      <pin position="5" pad="PB03"/>
      <pin position="6" pad="PB05"/>
      <pin position="7" pad="AVDD"/>
      <pin position="8" pad="GND"/>
      <pin position="9" pad="PA11"/>
      <pin position="10" pad="PA12"/>
      <pin position="11" pad="GND"/>
      <pin position="12" pad="PB06"/>
      <pin position="13" pad="PB07"/>
      <pin position="14" pad="PB08"/>
      <pin position="15" pad="PB09"/>
      <pin position="16" pad="PA04"/>
      <pin position="17" pad="PB10"/>
      <pin position="18" pad="PB11"/>
      <pin position="19" pad="GND"/>
      <pin position="20" pad="PA00"/>
      <pin position="21" pad="PA01"/>
      <pin position="22" pad="PB12"/>
      <pin position="23" pad="PB13"/>
      <pin position="24" pad="PA05"/>
      <pin position="25" pad="PA06"/>
      <pin position="26" pad="GND"/>
      <pin position="27" pad="VDD"/>
      <pin position="28" pad="VDD"/>
      <pin position="29" pad="PA08"/>
      <pin position="30" pad="PA09"/>
      <pin position="31" pad="PA07"/>
      <pin position="32" pad="PA10"/>
      <pin position="33" pad="PA13"/>
      <pin position="34" pad="PA14"/>
      <pin position="35" pad="PA02"/>
      <pin position="36" pad="PA03"/>
      <pin position="37" pad="PB02"/>
      <pin position="38" pad="PB01"/>
      <pin position="39" pad="PB04"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
